# YOLOv7  BiLevelRoutingAttention, Attention, AttentionLePE

# Parameters
nc: 1  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# YOLOv7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
  
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2      
   [-1, 1, Conv, [64, 3, 1]],
   
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4  
   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],  # 5
         

   [-1, 1, MP, []], # 6-P3/8  
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],  # 8
    

   [-1, 1, MP, []],  # 9-P4/16  
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],  # 11

         
   [-1, 1, MP, []],  # 12-P5/32  
   [-1, 1, Conv_ATT, [64, 3, 1]],
   [-1, 1, Conv_ATT, [64, 3, 1]],  # 2
   [-1, 1, Conv_ATT, [64, 3, 1]],  # 3
   [-1, 1, Conv_ATT, [64, 3, 1]],  # 4
  #  [-1, 1, Conv_ATT, [64, 3, 1]],  # 5
  #  [-1, 1, Conv_ATT, [64, 3, 1]],  # 6
  #  [-1, 1, Conv_ATT, [64, 3, 1]],  # 7
  #  [-1, 1, Conv_ATT, [64, 3, 1]],  # 8
  #  [-1, 1, Conv_ATT, [64, 3, 1]],  # 9
  #  [-1, 1, Conv_ATT, [64, 3, 1]],  # 10
  #  [-1, 1, Conv_ATT, [64, 3, 1]],  # 11
  #  [-1, 1, Conv_ATT, [64, 3, 1]],  # 12
  #  [-1, 1, Conv_ATT, [64, 3, 1]],  # 13
  #  [-1, 1, Conv_ATT, [64, 3, 1]],  # 14
  #  [-1, 1, Conv_ATT, [64, 3, 1]],  # 15
  #  [-1, 1, Conv_ATT, [64, 3, 1]],  # 16
  #  [-1, 1, Conv_ATT, [64, 3, 1]],  # 17
  #  [-1, 1, Conv_ATT, [64, 3, 1]],  # 18
  #  [-1, 1, Conv_ATT, [64, 3, 1]],  # 19
  #  [-1, 1, Conv_ATT, [64, 3, 1]],  # 20
  #  [-1, 1, Conv_ATT, [64, 3, 1]],  # 21
  #  [-1, 1, Conv_ATT, [64, 3, 1]],  # 22
  #  [-1, 1, Conv_ATT, [64, 3, 1]],  # 23
  #  [-1, 1, Conv_ATT, [64, 3, 1]],  # 24

  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 15
  
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [11, 1, Conv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 27
   
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [8, 1, Conv, [128, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]], # 43
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3, 29], 1, Concat, [1]],
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 56
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3, 17], 1, Concat, [1]],
   
   [-1, 1, Conv, [512, 1, 1]],
   [-2, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]], # 69
   
   [31, 1, Conv, [256, 3, 1]],
   [54, 1, Conv, [256, 3, 1]],
   [67, 1, Conv, [256, 3, 1]],

   [[68, 69, 70], 1, ISegment, [nc, anchors, 32, 256]],  # Detect(P3, P4, P5)
  ]